# -*- coding: UTF-8 -*-

import numpy as np

######################################
########## Marker coordinate #########
######################################
# 左上->右上->左下->右下
# x水平, y向下
M = np.array([[0, 0, 0.0],    
            [0.7, 0.0, 0.0],
            [0.0, 0.3, 0.0],
            [0.7, 0.3, 0.0]])
# x朝下(used),标定算法使用，y朝右
M_I = np.array([[0, 0, 0.0],
            [0.0, 0.7, 0.0],
            [0.3, 0.0, 0.0],
            [0.3, 0.7, 0.0]])

POINT_N = 4

######################################
# 不同全站仪配置输出参数不同
# 徕卡坐标系和车体坐标系不一致，需要手动更改
######################################

# 0519,此站用于c+01,n06-3,n09,n10,n13,n16,n08,n17

CAR_ID = "cp_001"
MARKER_TYPE = 1   # 徕卡: init_position 和 position
wheelbase = 5.175
# user setting
init_yaw = 0.0  # math.radians(0)   # radians, left is negative, -0.1,-0.3,-0.5,-0.8
init_p = [0.0, 0.0, 0.0] # position[x,y,z]
station_id = 75 # default: 0
###########################################
class FrontMarker_0:
      def __init__(self):
            self.name = "front_marker_0"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 车体坐标系 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [6.9593,7.0483,6.9539,7.0430]
            self.HAR = [[21,37,10],
                        [15,56,17],
                        [21,36,56],
                        [15,55,48]]
            self.V = [2.1326,2.1328,1.8327,1.8329]
            self.S = [6.9880,7.0767,6.9619,7.0509]
            self.ZA  = [[275,11,38],
                        [275,7,49],
                        [272,44,20],
                        [272,42,22]]
            self.position = [[4.906, 3.060, 2.760],
                             [5.187, 2.419, 2.766],
                             [4.910, 3.058, 2.460],
                             [5.192, 2.417, 2.467]]   #  x>0 y>0 z>0


class FrontMarker_1:
      def __init__(self):
            self.name = "front_marker_1"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [8.1857,8.2019,8.1885,8.2050]
            self.HAR = [[9,41,39],
                        [4,48,3],
                        [9,38,52],
                        [4,45,15]]
            self.V = [2.4361,2.4518,2.1364,2.1521]
            self.S = [8.2390,8.2569,8.2132,8.2309]
            self.ZA  = [[276,31,24],
                        [276,37,10],
                        [274,26,37],
                        [274,32,37]]
            self.position = [[6.490,0.987,2.997],
                             [6.763,0.343,2.987],
                             [6.504,0.997,2.697],
                             [6.781,0.354,2.688]]   #  x>0 y>0 z>0
             

class FrontMarker_2:
      def __init__(self):
            self.name = "front_marker_2"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [3.6611,3.6039,3.6610,3.6034]
            self.HAR = [[73,21,23],
                        [62,20,5],
                        [73,24,28],
                        [62,   23,6]]
            self.V = [1.7028,1.6954,1.4029,1.3954]
            self.S = [3.6667,3.6092,3.6623,3.6049]
            self.ZA  = [[273,10,16],
                        [273,6,14],
                        [268,28,48],
                        [268,20,11]]                          
            self.position = [[7.024,-0.554,2.972],
                             [6.984,-1.251,2.926],
                             [7.027,-0.534,2.673],
                             [6.988,-1.231,2.627]]   #  x>0 y>0 z>0

class FrontMarker_3:
      def __init__(self):
            self.name = "front_marker_3"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [4.0064,3.8720,4.0116,3.8761]
            self.HAR = [[300,1,40],
                        [290,1,23],
                        [300,1,47],
                        [290,2,16]]
            self.V = [1.6810,1.6780,1.3811,1.3780]
            self.S = [4.0105,3.8761,4.0134,3.8780]
            self.ZA  = [[272,35,13],
                        [272,37,55],
                        [268,18,5],
                        [268,11,48]]
            self.position = [[5.9167,-2.0531,2.5445],
                             [5.5975,-2.6760,2.5386],
                             [5.9199,-2.0521,2.2445],
                             [5.6010,-2.6752,2.2386]]   #  x>0 y>0 z>0

class LeftMarker_F0:
      def __init__(self):
            self.name = "left_marker_f0"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [3.6567,3.8376,3.6596,3.8428]
            self.HAR = [[127,55,8],
                        [117,34,8],
                        [127,46,13],
                        [117,26,11]]
            self.V = [1.6491,1.6728,1.3492,1.3730]
            self.S = [3.6597,3.8415,3.6627,3.8449]
            self.ZA  = [[272,20,3],
                        [272,34,42],
                        [267,38,26],
                        [268,6,24]]
            # new n_005       
            self.position = [[3.0753,3.1933,2.3469],
                             [3.5185,2.6517,2.3328],
                             [3.0775,3.2027,2.0469],
                             [3.5215,2.6617,2.0332]]   #  x>0 y>0 z>0

class LeftMarker_M0:
      def __init__(self):
            self.name = "left_marker_m0"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [3.6567,3.8376,3.6596,3.8428]
            self.HAR = [[127,55,8],
                        [117,34,8],
                        [127,46,13],
                        [117,26,11]]
            self.V = [1.6491,1.6728,1.3492,1.3730]
            self.S = [3.6597,3.8415,3.6627,3.8449]
            self.ZA  = [[272,20,3],
                        [272,34,42],
                        [267,38,26],
                        [268,6,24]]
            self.position = [[-1.9858,3.1227,1.9818],
                             [-1.3453,3.4055,1.9858],
                             [-1.9881,3.1322,1.6819],
                             [-1.3479,3.4158,1.6859]]   #  x>0 y>0 z>0
                             
class LeftMarker_R0:
      def __init__(self):
            self.name = "left_marker_r0"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [3.7132,3.6356,3.7048,3.6258]
            self.HAR = [[239,46,45],
                        [228,54,51],
                        [239,50,9],
                        [228,56,43]]
            self.V = [1.6648,1.6609,1.3650,1.3611]
            self.S = [3.7169,3.6392,3.7073,3.6285]
            self.ZA  = [[272,32,26],
                        [272,32,4],
                        [267,54,45],
                        [267,48,21]]
            self.position = [[-5.5993,2.7569,2.2644],
                             [-5.1150,3.2619,2.2817],
                             [-5.5989,2.7662,1.9646],
                             [-5.1137,3.2706,1.9818]]   #  x>0 y>0 z>0

class RightMarker_F0:
      def __init__(self):
            self.name = "right_marker_f0"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [3.6567,3.8376,3.6596,3.8428]
            self.HAR = [[127,55,8],
                        [117,34,8],
                        [127,46,13],
                        [117,26,11]]
            self.V = [1.6491,1.6728,1.3492,1.3730]
            self.S = [3.6597,3.8415,3.6627,3.8449]
            self.ZA  = [[272,20,3],
                        [272,34,42],
                        [267,38,26],
                        [268,6,24]]
            self.position = [[3.7905,-2.7749,2.3371],
                             [3.2737,-3.2478,2.3378],
                             [3.7931,-2.7790,2.0367],
                             [3.2771,-3.2516,2.0380]]   #  x>0 y>0 z>0

class RightMarker_M0:
      def __init__(self):
            self.name = "right_marker_m0"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [3.6567,3.8376,3.6596,3.8428]
            self.HAR = [[127,55,8],
                        [117,34,8],
                        [127,46,13],
                        [117,26,11]]
            self.V = [1.6491,1.6728,1.3492,1.3730]
            self.S = [3.6597,3.8415,3.6627,3.8449]
            self.ZA  = [[272,20,3],
                        [272,34,42],
                        [267,38,26],
                        [268,6,24]]
            self.position = [[-1.3077,-3.4187,2.0372],
                             [-1.9916,-3.2691,2.0423],
                             [-1.3112,-3.4241,1.7369],
                             [-1.9951,-3.2748,1.7422]]   #  x>0 y>0 z>0

class RightMarker_R0:
      def __init__(self):
            self.name = "right_marker_r0"
            self.init_angle_h = [0,0,0]
            self.init_angle_v = [0,0,0]
            self.init_position = [wheelbase,0.0,0.0]     # 全站仪和后轴中心点位置偏差: x,y,z
            self.H = [3.7132,3.6356,3.7048,3.6258]
            self.HAR = [[239,46,45],
                        [228,54,51],
                        [239,50,9],
                        [228,56,43]]
            self.V = [1.6648,1.6609,1.3650,1.3611]
            self.S = [3.7169,3.6392,3.7073,3.6285]
            self.ZA  = [[272,32,26],
                        [272,32,4],
                        [267,54,45],
                        [267,48,21]]
            self.position = [[-4.9631,-3.6580,2.2652],
                             [-5.4440,-3.1492,2.2628],
                             [-4.9694,-3.6652,1.9653],
                             [-5.4502,-3.1561,1.9629]]   #  x>0 y>0 z>0